function d = L2_distance(a, b)
%% -------------------------程序说明-------------------------------
%本程序用于计算矩阵的欧几里得距离
%格式 E = L2_distance(A,B)
%     A → DxM矩阵 
%     B → DxN矩阵
%返回值:E → MxN矩阵，A和B中向量之间的欧氏距离

%描述: 
%该程序通过以下方式计算两个矢量间的欧氏距离
%     ||A-B|| = sqrt ( ||A||^2 + ||B||^2 - 2*A.B )
%% --------------------------具体程序-------------------------------
%-------------------------------判断输入-----------------------------------
if nargin < 2
   error('输入参数不足');
end
if size(a, 1) ~= size(b, 1)
    error('A和B应该具有相同的维度');
end
if ~isreal(a) || ~isreal(b)
    warning('使用虚数计算距离表，结果可能会不一样'); 
end

%-------------------------------初始化-------------------------------------
if size(a, 1) == 1
    a = [a; zeros(1, size(a, 2))]; 
    b = [b; zeros(1, size(b, 2))]; 
end

%----------------------------计算距离表------------------------------------
d = sqrt(bsxfun(@plus, sum(a .* a)', bsxfun(@minus, sum(b .* b), 2 * a' * b)));

%-----------------------------确保结果是实数-------------------------------
d = real(d);
end

